---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.IsLoggedIn
source: html/c0c31280-6f0c-e72d-3af7-30aa548155e5.htm
---
# Autodesk.Revit.ApplicationServices.Application.IsLoggedIn Property

Checks if the user is logged in from this session to their Autodesk account.

## Syntax (C#)
```csharp
public static bool IsLoggedIn { get; }
```